       IDENTIFICATION DIVISION.  
       PROGRAM-ID. DISPLAY-PROFILE.
       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01  FULLNAME    PIC   X(50) VALUE "JAKKRIT CHAOPRON".
       01  PHONE       PIC   X(10) VALUE "0952829476".
       01  STUDENTID   PIC   9(8)  VALUE 62160246.
       01  GRADE       PIC   V99   VALUE 3.5.
       01  FLOATWITHSIGN PIC S9(3)V9(3) VALUE -123.123.
       01  FLOATWITHPLUSSIGN PIC S9V9    VALUE +1.0.
       01  ALPHABETS      PIC AAA VALUE "ABC".
       01  PRACTICESIGN   PIC S9(2) VALUE +10. 
       01  ZERO-PRAC      PIC X(10)   VALUE ZERO.
       01  ZEROS-PRAC     PIC X(10)   VALUE ZEROS.   

       PROCEDURE DIVISION.
       EXECUTE.
           DISPLAY FULLNAME 
           DISPLAY PHONE 
           DISPLAY STUDENTID 
           DISPLAY GRADE

           DISPLAY "PRACTICE MODE"
           DISPLAY FLOATWITHSIGN 
           DISPLAY FLOATWITHPLUSSIGN 
           DISPLAY ALPHABETS 
           DISPLAY PRACTICESIGN 
           DISPLAY ZERO-PRAC 
           DISPLAY ZEROS-PRAC 
           .
       END PROGRAM DISPLAY-PROFILE.   
