      * Program Property
       IDENTIFICATION DIVISION. 
      * Program ID ( Name or what program doin ) 
       PROGRAM-ID. HELLO-WORLD.
      * Data Division      
       DATA DIVISION.
      * Procedure Division
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
      *    Code area
           DISPLAY "Hello World :D".
       END PROGRAM HELLO-WORLD.


